### Lab For Using Pandas Groupby Function

Approximate time: 10 minutes.

**1).** Load in the users dataset

In [24]:
# Your Code Here
import pandas as pd
Users = ('/Users/swllms/DAT-10-14-SW/class material/Unit2/data/user.tbl')

In [26]:
df = pd.read_csv(Users, sep='|')
df.head ()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

**2).** For each occupation in "users", count the number of occurrences.

In [27]:
# Your Code Here
df.groupby('occupation')['occupation'].count()

occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
Name: occupation, dtype: int64

**3).** For each occupation, calculate the mean age.

In [29]:
# Your Code Here
df.groupby('occupation')['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

**4).** For each occupation, calculate the minimum and maximum ages.

In [33]:
# Your Code Here
df.groupby('occupation')['age'].nsmallest()

occupation
administrator  117    21
               179    22
               281    22
               316    22
               438    23
artist         600    19
               149    20
               595    20
               23     21
               781    21
doctor         250    28
               298    29
               934    42
               840    45
               137    46
educator       239    23
               155    25
               411    25
               739    25
               186    26
engineer       215    22
               486    22
               492    22
               843    22
               266    23
entertainment  178    15
               374    17
               15     21
               431    22
               254    23
                      ..
retired        643    51
               479    57
               233    60
               307    60
               751    60
salesman       924    18
               286    21
               335    23
               111    30
               530    30
scientist      625    23
               866    24
               352    25
               174    26
               762    27
student        29      7
               470    10
               608    13
               673    13
               879    13
technician     714    21
               811    22
               0      24
               3      24
               455    24
writer         506    18
               619    18
               49     21
               444    21
               800    22
Name: age, Length: 105, dtype: int64

In [34]:
df.groupby('occupation')['age'].nlargest()

occupation
administrator  802    70
               265    62
               130    59
               818    59
               6      57
artist         122    48
               145    45
               901    45
               835    44
               96     43
doctor         844    64
               426    51
               137    46
               840    45
               934    42
educator       857    63
               350    61
               89     60
               468    60
               930    60
engineer       766    70
               363    63
               933    61
               110    57
               156    57
entertainment  914    50
               925    49
               38     41
               838    38
               330    33
                      ..
retired        480    73
               859    70
               348    68
               572    68
               317    65
salesman       210    66
               752    56
               807    45
               385    36
               442    35
scientist      615    55
               13     45
               231    45
               928    44
               194    42
student        187    42
               564    40
               860    38
               576    36
               377    35
technician     196    55
               440    50
               324    48
               487    48
               457    47
writer         463    60
               557    56
               369    52
               391    52
               547    51
Name: age, Length: 105, dtype: int64

In [35]:
df.groupby('occupation')['age'].agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

**5).** For each combination of occupation and gender, calculate the mean age.

In [38]:
# Your Code Here
df.groupby(['occupation', 'gender'])['age'].mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

**6).** Find the female with the highest age in each occupation.

In [49]:
# Your Code Here
df[df.gender == 'F'].groupby('occupation')['age'].agg(max)

occupation
administrator    62
artist           48
educator         51
engineer         36
entertainment    38
executive        49
healthcare       53
homemaker        50
lawyer           51
librarian        59
marketing        50
none             55
other            55
programmer       38
retired          70
salesman         33
scientist        31
student          38
technician       38
writer           56
Name: age, dtype: int64